Revit 2027 API
ExternalDataManagerTool Methods
The ExternalDataManagerTool type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetChildCommandIds |  Obtains the sub menu of the item.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetChildCommandIds |  Sets the sub menu of the item
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternalDataManagerTool Class
Autodesk.Revit.UI Namespace